StrathbogieBrewing/butterfly/hardware/butterfly/avr/boards.txt
butterfly.name=Butterfly

butterfly.build.mcu=atmega169
butterfly.build.f_cpu=1000000L
butterfly.build.board=AVR_NG
butterfly.build.core=arduino:arduino
butterfly.build.variant=butterfly

butterfly.upload.maximum_size=15360
butterfly.upload.maximum_data_size=1024
butterfly.upload.tool=arduino:avrdude
butterfly.upload.speed=9600
butterfly.upload.protocol=avr109
butterfly.upload.params.quiet=-q

butterfly.bootloader.tool=avrdude
butterfly.bootloader.low_fuses=0x62
butterfly.bootloader.high_fuses=0xd2
butterfly.bootloader.path=butterfly
butterfly.bootloader.file=butterfly/butterfly.hex
butterfly.bootloader.unlock_bits=0x2F
butterfly.bootloader.lock_bits=0x2F
